src/test/testtool/RaadpleegMetBurgerservicenummer/02/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:str="http://exslt.org/strings" xmlns:w="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<StUF:organisatie>test1</StUF:organisatie>
			<StUF:applicatie>test123</StUF:applicatie>
			<StUF:administratie/>
			<StUF:gebruiker/>
		</StUF:zender>
		<StUF:ontvanger>
			<StUF:organisatie>0518</StUF:organisatie>
			<StUF:applicatie>LBA</StUF:applicatie>
			<StUF:administratie/>
			<StUF:gebruiker/>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241014193050762</StUF:tijdstipBericht>
		<StUF:crossRefnummer>af20ca23-3955-4406-89d2-3048f0017564</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<BG:inp.bsn>999993628</BG:inp.bsn>
			<BG:inp.a-nummer>3461805105</BG:inp.a-nummer>
			<BG:geslachtsnaam>Huijgen</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:voorletters>G.</BG:voorletters>
			<BG:voornamen>Geertje</BG:voornamen>
			<BG:aanduidingNaamgebruik>V</BG:aanduidingNaamgebruik>
			<BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
			<BG:geboortedatum>19010613</BG:geboortedatum>
			<BG:inp.geboorteplaats>Huisseling en Neerloon</BG:inp.geboorteplaats>
			<BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
			<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.overlijdenplaats xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.overlijdenLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.verblijftIn StUF:entiteittype="NPSTGO" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:wpl.woonplaatsNaam>'s-Gravenhage</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen/>
				<BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:aoa.postcode>2597LD</BG:aoa.postcode>
				<BG:aoa.huisnummer>58</BG:aoa.huisnummer>
				<BG:aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:begindatumVerblijf>20040404</BG:begindatumVerblijf>
			</BG:verblijfsadres>
			<BG:inp.adresHerkomst>W</BG:inp.adresHerkomst>
			<BG:inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.gemeenteVanInschrijving>0518</BG:inp.gemeenteVanInschrijving>
			<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:ing.indicatieBlokkering xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:aanduidingStrijdigheidNietigheid StUF:metagegeven="true" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<StUF:tijdvakGeldigheid>
				<StUF:beginGeldigheid xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<StUF:eindGeldigheid xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</StUF:tijdvakGeldigheid>
			<StUF:tijdstipRegistratie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT">
				<BG:gerelateerde StUF:entiteittype="NAT">
					<BG:code xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<BG:omschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				</BG:gerelateerde>
				<BG:inp.redenVerkrijging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:inp.datumVerkrijging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:inp.redenVerlies xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:inp.datumVerlies xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</BG:inp.heeftAlsNationaliteit>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>